Project/dataSlides/slides.tex
% Created 2018-05-27 Sun 16:19
\documentclass[bigger]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\usepackage[UTF8]{ctex}
\usetheme{Montpellier}
\author{Timothy Schwieg}
\date{\today}
\title{The Data Gathering Process}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section{What is the data?}
\label{sec-1}

\begin{frame}[label=sec-1-1]{Counter-Strike}
\begin{itemize}
\item What do the items do?
\item How are they obtained?
\item Do people seriously pay money for this stuff?
\end{itemize}
\end{frame}

\begin{frame}[label=sec-1-2]{Loot Boxes}
\begin{itemize}
\item What are loot boxes?
\item Is this the only way to obtain items?
\item How does the steam community market function?
\end{itemize}
\end{frame}

\begin{frame}[label=sec-1-3]{Steam Community market}
\begin{itemize}
\item What data is given?
\item Price and Quantity history over time
\item Current buy and sell orders unfulfilled
\item Not everything is sold on this market, but recently much more has
been.
\item Valve takes a percentage of sales, and is thoroughly incentivized to
ensure this.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-1-4]{Volume of items}
\begin{itemize}
\item There are $\sim 11000$ items sold on the market
\item While many are just multiple variants of the same item (quality or
slight color changes). This still is a lot of data to mine.
\item To achieve this, need to use the steam market api.
\end{itemize}
\end{frame}

\section{How do we get the data?}
\label{sec-2}

\begin{frame}[label=sec-2-1]{Steam Community Market API}
\begin{itemize}
\item First, we must get a list of all the available items on the market.
\item For each item in the market, there is a price history as well as
buy and sell orders available.
\item This data is returned via json format, and must be converted to .csv.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2-2]{How this is accomplished}
\begin{itemize}
\item Using the python packages Beautiful Soup, requests and json.
\item The pages that contain the items sold at market are returned in
html, and must be parsed for the internal api name of each item.
\item Once the internal name has been recovered, a request is sent for the
market data for this item, it is returned in json format, and
converted to a .csv table.
\end{itemize}
\end{frame}

\section{What next?}
\label{sec-3}

\begin{frame}[fragile,label=sec-3-1]{Building a file structure}
 \begin{itemize}
\item For Loot boxes, we are primarily interested in weapons which can be
found in the boxes.
\item The names of these weapons follow a particular pattern. Gun | Skin (
Condition )
\item This is the ideal place to use regular expressions to parse.
\item \texttt{regX = re.compile( r'(?P<gun>[a-zA-Z0-9 \textbackslash{}-]+)\textbackslash{}|(?P<skin>[a-zA-Z0-9
  \textbackslash{}-\textbackslash{}'\textbackslash{}!弐]+)(?P<quality>\textbackslash{}([a-zA-Z0-9 \textbackslash{}-]+\textbackslash{})).csv', re.UNICODE)}
\end{itemize}
\end{frame}


\begin{frame}[label=sec-3-2]{Exceptions}
\begin{itemize}
\item However there are a few exceptions that I handled by hard coding
them.
\item First among them is a skin titled: M4A4 | 龍王 (Dragon King)
\item Besides the obvious issue with Unicode, there is parenthesis in the
title that are not the quality.
\item The other problem is knives with no skin, which must be hard coded,
but there are only four cases to handle.
\item Once these are known, the file structure to be designed will be: gun
/ skin / condition
\end{itemize}
\end{frame}

\begin{frame}[label=sec-3-3]{Merging Loot Boxes and their contents}
\begin{itemize}
\item All the contents of the box are hand coded into files, and then
their rarity is recorded into a script which finds available
rarities for each item, and then gives each individual weapon its
probability of being found.
\item The last script takes the data on the price of each item in the market
at the time the loot box was sold, and records it in a .csv file.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-3-4]{The End Result}
\begin{itemize}
\item The end result is csv in the format where each row is a price and
quantity sold, or a buy order placed. For each of these rows: the
first three columns are the price, quantity, an indicator whether or
not it is a buy order or a sold item, and the remaining columns contain
price and probability of each item in the box.
\end{itemize}
\end{frame}
% Emacs 25.3.1 (Org mode 8.2.10)
\end{document}